###############################
# Taps                        #
###############################
tap 'homebrew/bundle'
tap 'beeftornado/rmtree'
tap 'buo/cask-upgrade'

###############################
# Binaries                    #
###############################
brew 'bat'
brew 'cmake'
brew 'git'
brew 'htop'
brew 'jq'
brew 'mackup'
brew 'mcfly'
brew 'openssh'
brew 'openssl'
brew 'python'
brew 'ssh-copy-id'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'

###############################
# Development                 #
###############################
cask 'miniconda'
cask 'visual-studio-code'
cask 'sublime-text'

###############################
# App Base                    #
###############################
cask 'alfred'
cask 'amethyst'
cask 'appcleaner'
cask 'chromium'
cask 'clipy'
cask 'docker'
cask 'dozer'
cask 'easyfind'
cask 'enpass'
cask 'firefox'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'little-snitch'
cask 'syncthing'
cask 'telegram'
cask 'tor-browser'
cask 'typora'
cask 'virtualbox'
cask 'virtualbox-extension-pack' # Only for personal use !
cask 'vlc'
cask 'zotero'
