###############################
# Taps                        #
###############################
tap 'beeftornado/rmtree'
tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

###############################
# Binaries                    #
###############################
brew 'bat'
brew 'cmake'
brew 'curl', args: ["with-openssl"], link: true, force: true
brew 'git'
brew 'htop'
brew 'jq'
brew 'mackup'
brew 'nmap'
brew 'openssh'
brew 'openssh'
brew 'openssl'
brew 'python'
brew 'ssh-copy-id'
brew 'syncthing'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

###############################
# Development                 #
###############################
cask 'miniconda'
cask 'java8'
brew 'sbt'
brew 'scala'
brew 'apache-spark'
cask 'visual-studio-code'
cask 'sublime-text'

###############################
# App Base                    #
###############################
cask 'alfred'
cask 'appcleaner'
cask 'chromium'
cask 'clipy'
cask 'docker'
cask 'dropbox'
cask 'easyfind'
cask 'firefox'
cask 'google-chrome'
cask 'istat-menus5'
cask 'iterm2'
cask 'libreoffice'
cask 'little-snitch'
cask 'macdown'
cask 'mactex'
cask 'skype'
cask 'spectacle'
cask 'telegram'
cask 'thunderbird'
cask 'torbrowser'
cask 'tunnelblick'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'zotero'